FILES/DataProcessors/ИнтерфейсЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>ИнтерфейсЧатов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектИнтерфейса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиентаБТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательОБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиОБТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

FILES/InformationRegisters/ЧатСПользователямиОБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЧатСПользователямиОБТ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПрикрепленныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КлючСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПользовательОБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиОБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыДляЧатов</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиентаБТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
						<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Система</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыДляЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВладелецСообщенияЧата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/Enums/ВладелецСообщенияЧата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВладелецСообщенияЧата</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/Enums/СистемыДляЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СистемыДляЧатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Watsapp</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BtripApp</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Reports</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FILES/DataProcessors/ИнтерфейсЧатов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьЧатНаСервере()
	
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	
	ШаблонСообщения = ОбъектСервер.ПолучитьМакет("СообщениеПользователя").ПолучитьТекст();
	ШаблонСообщенияОБТ = ОбъектСервер.ПолучитьМакет("СообщениеПользователяОБТ").ПолучитьТекст();
	//"
	//|<DIV class=""[Расположение]"">
	//|    <div class=""picture"">[Лого]</div>
	//|    <div class=""message"">[Сообщение]</div>
	//|</DIV>
	//|";
	
	Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ПользовательОБТ", Объект.ПользовательОБТ);
	Запрос.УстановитьПараметр("Объект", Объект.ОбъектИнтерфейса);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	               |	ЧатСПользователямиОБТ.Период КАК Период,
	               |	ЧатСПользователямиОБТ.ПользовательОБТ КАК ПользовательОБТ,
	               |	ЧатСПользователямиОБТ.Пользователь КАК Пользователь,
	               |	ЧатСПользователямиОБТ.Объект КАК Объект,
	               |	ЧатСПользователямиОБТ.Система КАК Система,
	               |	ЧатСПользователямиОБТ.Владелец КАК Владелец,
	               |	ЧатСПользователямиОБТ.Сообщение КАК Сообщение,
	               |	ЧатСПользователямиОБТ.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	               |ИЗ
	               |	РегистрСведений.ЧатСПользователямиОБТ КАК ЧатСПользователямиОБТ
	               |ГДЕ
	               |	ЧатСПользователямиОБТ.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЧатСПользователямиОБТ.Период УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Чат = "";
	Пока Выборка.Следующий() Цикл
		
		ПараметрыШаблона = Новый Структура("Расположение, Лого, Сообщение, ДатаВремя", 
			?(Выборка.Владелец = Перечисления.ВладелецСообщенияЧата.Клиент, "left", "rigth"),
			?(Выборка.Владелец = Перечисления.ВладелецСообщенияЧата.Клиент, Выборка.ПользовательОБТ, Выборка.Пользователь),
			Выборка.Сообщение,
			Выборка.Период
		);	
		
		Если Выборка.Владелец = Перечисления.ВладелецСообщенияЧата.Клиент Тогда
			СообщениеЧата = ШаблонСообщенияОБТ;
		Иначе
			СообщениеЧата = ШаблонСообщения;		
		КонецЕсли;
		
		Для Каждого ПараметрШаблона ИЗ ПараметрыШаблона Цикл
			СообщениеЧата = СтрЗаменить(СообщениеЧата, "["+ПараметрШаблона.Ключ+"]", ПараметрШаблона.Значение);	
		КонецЦикла;
		
		Чат = СообщениеЧата + Чат;
	КонецЦикла;
	
	Макет = ОбъектСервер.ПолучитьМакет("МакетЧата").ПолучитьТекст();
	Макет = СтрЗаменить(Макет, "[Чат]", Чат);
	
	HTMLДок = Макет;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЧат(Команда)
	ЗагрузитьЧатНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	Вопрос = Новый Структура("Владелец, ПользовательОБТ, Пользователь, Объект, Система, Сообщение",
		Перечисления.ВладелецСообщенияЧата.Сотрудник, 
		Объект.ПользовательОБТ, 
		ПараметрыСеанса.ТекущийПользователь, 
		Объект.ОбъектИнтерфейса, 
		Перечисления.СистемыДляЧатов.БТ, 
		Сообщение);

	МоментВремени = ТекущаяДата();
	Чат = РегистрыСведений.ЧатСПользователямиОБТ.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Чат, Вопрос);
	Чат.Период = МоментВремени;
	Чат.КлючСообщения = Новый УникальныйИдентификатор();
	Чат.Записать(Истина);
	
	
	Сообщение = "";

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
	ЗагрузитьЧатНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбъектИнтерфейсаПриИзменении(Элемент)
	ЗагрузитьЧатНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ОбъектыОбщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		Объект.ОбъектИнтерфейса = Элемент.ТекущиеДанные.ОбъектОбщения;
		ОбъектИнтерфейсаПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьЧатыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПользовательОБТ", Объект.ПользовательОБТ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ЧатСПользователямиОБТ.Период) КАК Период,
	               |	ЧатСПользователямиОБТ.ПользовательОБТ КАК ПользовательОБТ
	               |ПОМЕСТИТЬ ПоследниеСообщенияПоОбъектам
	               |ИЗ
	               |	РегистрСведений.ЧатСПользователямиОБТ КАК ЧатСПользователямиОБТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧатСПользователямиОБТ.ПользовательОБТ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 20
	               |	МАКСИМУМ(ПоследниеСообщенияПоОбъектам.Период) КАК Период,
	               |	ПоследниеСообщенияПоОбъектам.ПользовательОБТ КАК ПользовательОБТ
	               |ИЗ
	               |	ПоследниеСообщенияПоОбъектам КАК ПоследниеСообщенияПоОбъектам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследниеСообщенияПоОбъектам.ПользовательОБТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	ПользователиОБТ.Загрузить(Выгрузка);
	
КонецПроцедуры

&НаСервере
Процедура ПользовательОБТПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПользовательОБТ", Объект.ПользовательОБТ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЧатСПользователямиОБТ.Объект КАК Объект,
	               |	МАКСИМУМ(ЧатСПользователямиОБТ.Период) КАК Период
	               |ПОМЕСТИТЬ ПоследниеСообщенияПоОбъектам
	               |ИЗ
	               |	РегистрСведений.ЧатСПользователямиОБТ КАК ЧатСПользователямиОБТ
	               |ГДЕ
	               |	ЧатСПользователямиОБТ.ПользовательОБТ = &ПользовательОБТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧатСПользователямиОБТ.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 20
	               |	ПоследниеСообщенияПоОбъектам.Объект КАК ОбъектОбщения,
	               |	МАКСИМУМ(ПоследниеСообщенияПоОбъектам.Период) КАК Период
	               |ИЗ
	               |	ПоследниеСообщенияПоОбъектам КАК ПоследниеСообщенияПоОбъектам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПоследниеСообщенияПоОбъектам.Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	ОбъектыОбщения.Загрузить(Выгрузка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОБТПриИзменении(Элемент)
	ПользовательОБТПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьЧатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Обновим списки чатов при любом событии
	ЗагрузитьЧатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПользователиОБТВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЭтаФорма.Элементы.ПользователиОБТ.ТекущиеДанные <> Неопределено Тогда
		Объект.ПользовательОБТ = ЭтаФорма.Элементы.ПользователиОБТ.ТекущиеДанные.ПользовательОБТ;
		ПользовательОБТПриИзмененииНаСервере();
		Если ОбъектыОбщения.Количество() > 0 Тогда
			Объект.ОбъектИнтерфейса = ОбъектыОбщения[0].ОбъектОбщения;
			ОбъектИнтерфейсаПриИзменении(Элемент);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
